//-------------------------------------------------------------------------------
// RunUpSysBuild.h
// А. Николенко 26.11.2018
//------------------------------------------------------------------------------- 
#ifndef RUN_UP_SYS_BUILD_H
#define RUN_UP_SYS_BUILD_H

//-------------------------------------------------------------------------------
// Формирование совокупности НУ для 8-и КА системы "Разбег"
// в двух плоскостях, по 4 КА в каждой плоскости. 
int RunUpSysBuild_4_4(ZNU* NU, ZLSF& LSF, int CountKA) ; 
// Уточнение НУ с целью формирования онрбиты заданной средне-интегральной высоты 
int RunUpSysEstimateNU(ZLSF& LSF, ZNU& NU0, ZNU& NUK, double uz, double e1z, double e2z, double az, double havrz=0) ; 

//------------------------------------------------------------------------------- 
#endif // #ifndef RUN_UP_SYS_BUILD_H