//---------------------------------------------------------------------------
// ZFGPZLoad.cpp
// А. Николенко 03.08.2018
//---------------------------------------------------------------------------
#include <stdafx.h>
#pragma   hdrstop
//---------------------------------------------------------------------------
#include <FlyCoreSource\\ModType.h>
#include <FlyCoreSource\\ZFGPZLoad.h>
#include <FlyCoreSource\\ZMForceGrav.h>
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
int ZFGravPoleLoad( GRAV_FIELD* GravPole, long VariantGPZ, long SizeGPZ )
{
	if (!GravPole) return 1 ; 
	GravPole->Clear() ;
	return 0 ;
}
//---------------------------------------------------------------------------
