//------------------------------------------------------------------------
//  ANW.C
//    РАСЧЕТ АМПЛИТУДЫ ПО КОЭФФИЦИЕНТАМ ФУРЬЕ
//  Автор   : Пасынков В.В.
//  Версия  : 01.00 / 16.09.2000 /
//------------------------------------------------------------------------
#include <math.h>
#include "ssp.h"

//Расчет амплитудно-частотной характеристики (АЧХ) спектра: An(w)
// w = 2*pi*f = 2*pi*n*f1 = 2*pi*n/T
double Anw(double aw,double bw)
{
double anw;
  anw=aw*aw+bw*bw;
  anw=sqrt(anw);
return anw;
}
