//-----------------------------------------------------------------------
//   NORMX.C
//   Подпрограмма приведения аргумента затабулированной функции
//   к интервалу [dr,dl]
//   Автор  : Пасынков В.В.
//   Версия  : 01.00 / 10.08.1997 /
//------------------------------------------------------------------------
#include "ssp.h"

void  normx(double dl, double dr, double top[], int n, double *x0, double *xd)
{
	// Подпрограмма приведения аргумента затабулированной функции
	// к интервалу [dr,dl]
	int    i;
	double xa, xm;
	xa = top[0]; (*x0) = xa; //xe = 0.e0;
	for (i = 0; i < n; i++){
		xm = top[i];
		if ((xa-xm)>0.0) xa = xm;   //xl
		if (((*x0)-xm) < 0.0) (*x0) = xm;//xr
	}
	(*xd) = (*x0)-xa;		//xr-xl
	if ((*xd)<=0.0) return;	//Ош
	(*x0) =-(dr*(*x0)+dl*xa)/(*xd);
	(*xd) = (dr-dl)/(*xd);
	//Нормировка
	for (i=0; i<n; i++)	top[i] = top[i]*(*xd)+(*x0);

	return;
}
