/*---------------------------------------------------------------------------
  RANDM.C
   ГЕНЕРАТОР ПСЕВДОСЛУЧАЙНЫХ ЧИСЕЛ (ДСЧ) ПО РАВНОМЕРНОМУ ЗАКОНУ
   (ВИКА им. А.Ф.Можайского)
  Автор	 : программирование выполнил Пасынков В.В.
  Версия : 01.00 / 15.04.1994 /
---------------------------------------------------------------------------*/
#include <stdio.h>
#include <math.h>
double randm(void)
{
static double  u1=3.14159265,u2=0.542101887;
double t;
t=u1+u2;
u1=u2;
if(t>4.0) t-=4.0;
u2=t;
t/=4.0;
return t;
}

