//------------------------------------------------------------------------
//  SQFT.C
//    ПОДПРОГРАММА РАСЧЕТА КВАДРАТИЧНОЙ ФОРМЫ
//      C(M,L)=A(M,N)*P(N,K)*tans(S(L,K))+W(M,L)
//  Автор   : Пасынков В.В.
//  Версия  : 01.00 / 05.12.2000 /
//------------------------------------------------------------------------
#include "ssp.h"
/*     ..................................................................

	Подпрограмма SQFT

	Назначение
	  Расчет квадратичной формы вида
	  C(M,L)=A(M,N)*P(N,K)*tans(S(L,K))+W(M,L)
	Прототип
	  void sqft(double *a, double *p, double *s, double *w,
	    int M, int N, int K, int L, double *c);

	Описание параметров
	   a - A[M*N] матрица общего вида,
	   p - P[N*K] матрица общего вида,
	   s - S[L*K] матрица общего вида,
	   w - W[M*L] матрица общего вида,
	       Примечание:
	       если указатель равен NULL,то
	       матрица W в вычислениях не участвует,
	   M - число строк матриц А, W и С,
	   N - число столбцов матрицы A и строк матрицы P,
	   K - число столбцов матриц P и S,
	   L - число строк матрицы S и столбцов матриц W и С,
	   c - С[M*L] результирующая матрица общего вида
     ..................................................................
 */

void sqft(double *a, double *p, double *s, double *w,
	   int M, int N, int K, int L, double *c)
{
#define A(I_,J_)	*(a+(I_)*(N)+(J_))
#define P(I_,J_)	*(p+(I_)*(K)+(J_))
#define S(I_,J_)	*(s+(J_)*(K)+(I_))
#define W(I_,J_)	*(w+(I_)*(L)+(J_))
#define C(I_,J_)	*(c+(I_)*(L)+(J_))
/*
     ПОДПРОГРАММА РАСЧЕТА КВАДРАТИЧНОЙ ФОРМЫ:
	C(M,L)=A(M,N)*P(N,K)*tans(S(L,K))+W(M,L)
 */
int m, l, n, k;

for( m = 0; m < M; m++ )
  for( l = 0; l < L; l++ )
    for( C(m,l) = 0.0 ,n = 0; n < N; n++ )
       for( k = 0; k < K; k++ )
	 C(m,l) += ( A(m,n)* P(n,k) * S(k,l) );
if(w)
  for( m = 0; m < M; m++ )
    for( l = 0; l < L; l++ )
      C(m,l) += W(m,l);
return;
#undef	C
#undef	W
#undef	S
#undef	P
#undef	A
}




