/*------------------------------------------------------------------------
  VCPY.C
	  КОПИРОВАНИЕ ВЕКТОРА
  Автор   : Пасынков В.В.
  Версия  : 01.00 / 10.08.1997 /
------------------------------------------------------------------------*/
#include "ssp.h"
/* ...............................................................
	SUBROUTINE VECCPY
..................................................................*/

void veccpy(double qout[], double qin[], int sz)
{
	register i ;
	if(!qout) return ;
	for( i = 0; i < sz; i++ ) {
		if(!qin) qout[i] = 0.0;
		else     qout[i] = qin[i];
	}
}
