//-------------------------------------------------------------------------------
// TaskCalcTargDir.h
// А. Николенко 18.12.2018
//
// Расчёт и документирование ЦУ для антенны в пределах ЗРВ КА-НИП
//------------------------------------------------------------------------------- 
#ifndef TASK_CALC_TARG_DIR_H
#define TASK_CALC_TARG_DIR_H

//-------------------------------------------------------------------------------
// Закрытие всех текстовых документов созданных для документирования ЦУ
void  TargDirFileCloseAll() ;
// Создание имени файла для документирования ЦУ для заданного КА
void  TargDirFileName(int NumKA, int NipInd, long Vit, char* FN) ;
// Создание или открытие текстового документа для документирование ЦУ
FILE* TargDirFileOpen(int NumKA, int NipInd, long Vit, double t1, double t2) ;
// Расчёт и документирование ЦУ для заданного НИП - NipInd, КА - NumKA, 
// на интервале времени [t1, t2], с начальными условиями в АСК1975 - Xasc1975
int   CalcTargDir(int NumKA, int NipInd, long Vit, double* Xasc1975, double t1, double t2) ;

//------------------------------------------------------------------------------- 
#endif // #ifndef TASK_CALC_TARG_DIR_H